{"listing": [{"neighborhood": "Downtown", "price": 500000, "bedrooms": 3, "bathrooms": 2, "house_size": 2000, "description": "Beautiful modern condo in the heart of downtown. Spacious living area with high ceilings and large windows. Updated kitchen with stainless steel appliances. Master bedroom with en-suite bathroom. Close to restaurants, shops, and public transportation.", "neighborhood_description": "Vibrant neighborhood with a mix of residential and commercial buildings."}, {"neighborhood": "Suburbia", "price": 400000, "bedrooms": 4, "bathrooms": 3, "house_size": 2500, "description": "Charming family home in a quiet suburban neighborhood. Open floor plan with a cozy fireplace in the living room. Updated kitchen with granite countertops. Master suite with walk-in closet. Backyard with a patio and garden.", "neighborhood_description": "Family-friendly area with parks and schools nearby."}, {"neighborhood": "Waterfront", "price": 700000, "bedrooms": 2, "bathrooms": 2, "house_size": 1800, "description": "Luxurious waterfront condo with stunning views of the bay. Floor-to-ceiling windows in the living room. Gourmet kitchen with top-of-the-line appliances. Master suite with a spa-like bathroom. Balcony overlooking the water.", "neighborhood_description": "Exclusive waterfront community with marina and waterfront dining."}, {"neighborhood": "Historic District", "price": 600000, "bedrooms": 3, "bathrooms": 2, "house_size": 2200, "description": "Historic townhouse with original architectural details. Elegant living room with a fireplace. Formal dining room with period features. Updated kitchen with a breakfast nook. Master bedroom with a private balcony.", "neighborhood_description": "Quaint neighborhood with cobblestone streets and historic landmarks."}, {"neighborhood": "Mountain View", "price": 450000, "bedrooms": 3, "bathrooms": 2, "house_size": 1900, "description": "Cozy mountain retreat with panoramic views of the mountains. Rustic cabin-style home with a stone fireplace. Open kitchen and dining area. Master bedroom with a private deck. Surrounded by nature trails and wildlife.", "neighborhood_description": "Tranquil mountain community with hiking and skiing opportunities."}, {"neighborhood": "Beachfront", "price": 800000, "bedrooms": 4, "bathrooms": 3, "house_size": 2800, "description": "Beachfront property with direct access to the sandy shore. Spacious living room with ocean views. Gourmet kitchen with a breakfast bar. Master suite with a walk-in closet. Outdoor deck for entertaining.", "neighborhood_description": "Prime beachfront location with water sports and beach activities."}, {"neighborhood": "Golf Course Community", "price": 650000, "bedrooms": 3, "bathrooms": 2, "house_size": 2100, "description": "Golf course home with views of the fairway. Open concept living space with vaulted ceilings. Updated kitchen with granite countertops. Master suite with a soaking tub. Backyard patio overlooking the golf course.", "neighborhood_description": "Golf enthusiasts' paradise with access to golf courses and country club amenities."}, {"neighborhood": "Lakefront", "price": 750000, "bedrooms": 4, "bathrooms": 3, "house_size": 2600, "description": "Lakefront retreat with a private dock for boating. Spacious living area with lake views. Chef's kitchen with a large island. Master suite with a balcony overlooking the water. Outdoor patio for lakeside dining.", "neighborhood_description": "Serene lakefront community with water activities and fishing opportunities."}, {"neighborhood": "City Center", "price": 550000, "bedrooms": 2, "bathrooms": 2, "house_size": 1700, "description": "Modern city center apartment with skyline views. Open floor plan with floor-to-ceiling windows. Sleek kitchen with quartz countertops. Master bedroom with a walk-in closet. Balcony for city views.", "neighborhood_description": "Convenient location in the heart of the city with access to restaurants and entertainment venues."}, {"neighborhood": "Countryside", "price": 350000, "bedrooms": 3, "bathrooms": 2, "house_size": 1800, "description": "Quaint countryside cottage with a wrap-around porch. Cozy living room with a wood-burning stove. Country kitchen with farmhouse sink. Master bedroom with a clawfoot tub. Large backyard with a garden.", "neighborhood_description": "Tranquil countryside setting with rolling hills and farmland views."}, {"neighborhood": "Ski Resort", "price": 900000, "bedrooms": 5, "bathrooms": 4, "house_size": 3000, "description": "Luxury ski resort chalet with ski-in/ski-out access. Spacious great room with a stone fireplace. Gourmet kitchen with a breakfast bar. Master suite with a private hot tub. Outdoor deck with mountain views.", "neighborhood_description": "Ski-in/ski-out community with access to ski slopes and winter activities."}, {"neighborhood": "Riverside", "price": 480000, "bedrooms": 3, "bathrooms": 2, "house_size": 2000, "description": "Riverside home with views of the river. Open living area with a fireplace. Updated kitchen with river views. Master bedroom with a balcony overlooking the water. Outdoor deck for riverfront dining.", "neighborhood_description": "Tranquil riverside community with boating and fishing opportunities."}, {"neighborhood": "Art District", "price": 620000, "bedrooms": 2, "bathrooms": 2, "house_size": 1900, "description": "Contemporary loft in the vibrant art district. Open concept living space with exposed brick walls. Modern kitchen with stainless steel appliances. Master suite with a walk-in closet. Rooftop terrace with city views.", "neighborhood_description": "Creative hub with art galleries, studios, and cultural events."}, {"neighborhood": "Historic Landmark", "price": 680000, "bedrooms": 4, "bathrooms": 3, "house_size": 2400, "description": "Historic landmark property with period details. Grand foyer with a staircase. Formal living and dining rooms with original features. Updated kitchen with a butler's pantry. Master suite with a sitting area.", "neighborhood_description": "Preserved historic district with architectural significance."}, {"neighborhood": "Waterfront Estate", "price": 950000, "bedrooms": 6, "bathrooms": 5, "house_size": 3500, "description": "Majestic waterfront estate with panoramic water views. Formal living room with a fireplace. Chef's kitchen with a breakfast nook. Master suite with a private balcony. Outdoor pool and spa.", "neighborhood_description": "Exclusive waterfront community with luxury estates and private docks."}, {"neighborhood": "Downtown Loft", "price": 520000, "bedrooms": 2, "bathrooms": 2, "house_size": 1600, "description": "Industrial-style loft in the downtown area. Open floor plan with exposed ductwork and concrete floors. Modern kitchen with a breakfast bar. Master bedroom with a walk-in closet. Rooftop deck with city views.", "neighborhood_description": "Trendy downtown neighborhood with loft-style living spaces."}, {"neighborhood": "Parkside", "price": 430000, "bedrooms": 3, "bathrooms": 2, "house_size": 1700, "description": "Charming parkside bungalow with a front porch. Cozy living room with a fireplace. Updated kitchen with a breakfast nook. Master bedroom with a walk-in closet. Backyard with a deck and garden.", "neighborhood_description": "Tranquil neighborhood with a park and walking trails."}, {"neighborhood": "Lake View", "price": 780000, "bedrooms": 4, "bathrooms": 3, "house_size": 2700, "description": "Lake view property with a deck overlooking the water. Spacious living area with a stone fireplace. Gourmet kitchen with a center island. Master suite with a soaking tub. Outdoor patio for lakeside entertaining.", "neighborhood_description": "Scenic lake view community with water activities and boating."}, {"neighborhood": "Historic District Mansion", "price": 1000000, "bedrooms": 7, "bathrooms": 6, "house_size": 4000, "description": "Stately mansion in the historic district with period architecture. Formal living and dining rooms with original details. Chef's kitchen with a butler's pantry. Master suite with a sitting area and fireplace. Landscaped gardens.", "neighborhood_description": "Prestigious historic district with grand homes and tree-lined streets."}]}