{"listing": [{"neighborhood": "Downtown", "price": 500000, "bedrooms": 3, "bathrooms": 2, "house_size": 2000, "description": "Beautiful modern condo in the heart of downtown. Spacious living area with stunning city views. Updated kitchen with stainless steel appliances. Master bedroom with ensuite bathroom. Amenities include gym and rooftop terrace.", "neighborhood_description": "Vibrant neighborhood with restaurants, shops, and entertainment options."}, {"neighborhood": "Suburbia", "price": 400000, "bedrooms": 4, "bathrooms": 3, "house_size": 2500, "description": "Charming family home in a quiet suburban neighborhood. Large backyard with a deck for outdoor entertaining. Cozy living room with fireplace. Master suite with walk-in closet. Close to schools and parks.", "neighborhood_description": "Family-friendly area with good schools and green spaces."}, {"neighborhood": "Waterfront", "price": 700000, "bedrooms": 2, "bathrooms": 2, "house_size": 1800, "description": "Luxurious waterfront condo with panoramic views of the ocean. Open concept living space with high-end finishes. Master suite with spa-like bathroom. Private balcony overlooking the water.", "neighborhood_description": "Exclusive waterfront community with marina and beach access."}, {"neighborhood": "Historic District", "price": 600000, "bedrooms": 3, "bathrooms": 2, "house_size": 2200, "description": "Historic charm meets modern amenities in this renovated home. Original hardwood floors and exposed brick walls. Gourmet kitchen with quartz countertops. Spacious bedrooms with ample natural light.", "neighborhood_description": "Quaint neighborhood with cobblestone streets and historic architecture."}, {"neighborhood": "Mountain View", "price": 450000, "bedrooms": 3, "bathrooms": 2, "house_size": 1900, "description": "Cozy mountain retreat with stunning views of the surrounding peaks. Vaulted ceilings and wood-burning fireplace in the living room. Updated kitchen with granite countertops. Master bedroom with en-suite bathroom.", "neighborhood_description": "Tranquil setting with hiking trails and outdoor activities nearby."}, {"neighborhood": "Lakefront", "price": 800000, "bedrooms": 4, "bathrooms": 3, "house_size": 2800, "description": "Elegant lakefront property with private dock and boathouse. Spacious living area with lake views. Chef's kitchen with top-of-the-line appliances. Master suite with balcony overlooking the water.", "neighborhood_description": "Sought-after lakefront community with water sports and recreation options."}, {"neighborhood": "Golf Course Community", "price": 550000, "bedrooms": 3, "bathrooms": 2, "house_size": 2100, "description": "Golf course living at its finest in this custom-built home. Open floor plan with golf course views. Gourmet kitchen with breakfast nook. Master suite with walk-in closet and spa-like bathroom.", "neighborhood_description": "Golf enthusiasts' paradise with access to the course and clubhouse."}, {"neighborhood": "Beachfront", "price": 750000, "bedrooms": 2, "bathrooms": 2, "house_size": 1700, "description": "Contemporary beachfront condo with direct access to the sand. Floor-to-ceiling windows in the living room. Modern kitchen with quartz countertops. Master suite with walk-in closet and ocean views.", "neighborhood_description": "Prime beachfront location with restaurants and shops within walking distance."}, {"neighborhood": "Ski Resort", "price": 900000, "bedrooms": 5, "bathrooms": 4, "house_size": 3000, "description": "Ski-in/ski-out chalet at the base of the mountain. Rustic yet luxurious interior with stone fireplace. Gourmet kitchen with breakfast bar. Master suite with private balcony and hot tub.", "neighborhood_description": "Winter wonderland with skiing, snowboarding, and apres-ski activities."}, {"neighborhood": "Rural Countryside", "price": 350000, "bedrooms": 2, "bathrooms": 1, "house_size": 1500, "description": "Quaint farmhouse on acres of peaceful countryside. Wrap-around porch with scenic views. Cozy living room with wood-burning stove. Master bedroom with walk-in closet. Perfect for those seeking a quiet retreat.", "neighborhood_description": "Tranquil setting with rolling hills and farmland views."}, {"neighborhood": "City Center", "price": 650000, "bedrooms": 3, "bathrooms": 2, "house_size": 2300, "description": "Modern city living in a spacious downtown condo. Floor-to-ceiling windows with city views. Sleek kitchen with quartz countertops. Master suite with walk-in closet and spa-like bathroom. Building amenities include a fitness center and concierge.", "neighborhood_description": "Convenient location with access to restaurants, shopping, and public transportation."}, {"neighborhood": "Historic Landmark", "price": 700000, "bedrooms": 4, "bathrooms": 3, "house_size": 2600, "description": "Stately historic home with period details and modern updates. Grand foyer with staircase. Formal living and dining rooms. Chef's kitchen with high-end appliances. Master suite with sitting area and fireplace.", "neighborhood_description": "Prestigious neighborhood with historic homes and tree-lined streets."}, {"neighborhood": "Waterfront Estate", "price": 1200000, "bedrooms": 6, "bathrooms": 5, "house_size": 4000, "description": "Magnificent waterfront estate with private beach and infinity pool. Expansive living spaces with water views. Gourmet kitchen with marble countertops. Luxurious master suite with spa-like bathroom and walk-in closet.", "neighborhood_description": "Exclusive waterfront community with luxury homes and amenities."}, {"neighborhood": "Mountain Retreat", "price": 550000, "bedrooms": 3, "bathrooms": 2, "house_size": 2000, "description": "Secluded mountain retreat with panoramic views of the valley. Open concept living area with stone fireplace. Chef's kitchen with breakfast bar. Master suite with private balcony.", "neighborhood_description": "Peaceful setting with hiking trails and wildlife sightings."}, {"neighborhood": "Lake View", "price": 650000, "bedrooms": 4, "bathrooms": 3, "house_size": 2400, "description": "Charming lake view cottage with wrap-around porch. Cozy living room with stone fireplace. Updated kitchen with stainless steel appliances. Master suite with lake views. Perfect for a weekend getaway or year-round living.", "neighborhood_description": "Tranquil lakeside community with boating and fishing opportunities."}, {"neighborhood": "Gated Community", "price": 750000, "bedrooms": 4, "bathrooms": 3, "house_size": 2800, "description": "Luxury living in a gated community with security and privacy. Spacious floor plan with high ceilings. Gourmet kitchen with island and pantry. Master suite with walk-in closet and spa-like bathroom.", "neighborhood_description": "Exclusive community with amenities such as pool, tennis courts, and clubhouse."}, {"neighborhood": "Historic District", "price": 600000, "bedrooms": 3, "bathrooms": 2, "house_size": 2200, "description": "Charming historic home with original architectural details. Formal living and dining rooms. Updated kitchen with breakfast nook. Master suite with walk-in closet. Landscaped backyard with patio.", "neighborhood_description": "Preserved historic neighborhood with tree-lined streets and period homes."}, {"neighborhood": "Ski Chalet", "price": 800000, "bedrooms": 4, "bathrooms": 3, "house_size": 2600, "description": "Ski chalet with mountain views and ski-in/ski-out access. Rustic yet elegant interior with stone fireplace. Gourmet kitchen with breakfast bar. Master suite with private balcony and hot tub.", "neighborhood_description": "Ideal location for winter sports enthusiasts with access to ski slopes and apres-ski activities."}, {"neighborhood": "Beach House", "price": 900000, "bedrooms": 3, "bathrooms": 2, "house_size": 1800, "description": "Beachfront property with stunning ocean views. Open concept living area with vaulted ceilings. Modern kitchen with breakfast bar. Master suite with walk-in closet and private balcony overlooking the water.", "neighborhood_description": "Relaxing beachfront community with sandy shores and coastal charm."}, {"neighborhood": "Country Estate", "price": 1000000, "bedrooms": 5, "bathrooms": 4, "house_size": 3200, "description": "Sprawling country estate with acres of land and mountain views. Grand foyer with staircase. Formal living and dining rooms. Chef's kitchen with butler's pantry. Master suite with sitting area and fireplace.", "neighborhood_description": "Private retreat with lush gardens and outdoor entertaining spaces."}, {"neighborhood": "Downtown Loft", "price": 500000, "bedrooms": 2, "bathrooms": 2, "house_size": 1600, "description": "Industrial chic loft in the heart of downtown. Open floor plan with exposed brick walls and high ceilings. Modern kitchen with stainless steel appliances. Master suite with walk-in closet. Rooftop deck with city views.", "neighborhood_description": "Trendy urban neighborhood with art galleries, cafes, and nightlife."}, {"neighborhood": "Waterfront Mansion", "price": 1500000, "bedrooms": 7, "bathrooms": 6, "house_size": 5000, "description": "Opulent waterfront mansion with private dock and pool. Grand living spaces with water views. Chef's kitchen with top-of-the-line appliances. Luxurious master suite with spa-like bathroom and walk-in closet.", "neighborhood_description": "Exclusive waterfront enclave with luxury estates and marina access."}, {"neighborhood": "Mountain Cabin", "price": 400000, "bedrooms": 2, "bathrooms": 1, "house_size": 1200, "description": "Cozy mountain cabin with rustic charm. Wood-paneled walls and stone fireplace in the living room. Compact kitchen with breakfast bar. Master bedroom with mountain views. Perfect for a weekend retreat.", "neighborhood_description": "Secluded mountain setting with hiking trails and wildlife."}, {"neighborhood": "Lakefront Retreat", "price": 700000, "bedrooms": 3, "bathrooms": 2, "house_size": 1900, "description": "Tranquil lakefront retreat with private dock and deck. Open concept living area with lake views. Updated kitchen with granite countertops. Master suite with walk-in closet and balcony overlooking the water.", "neighborhood_description": "Peaceful lakeside community with boating and fishing opportunities."}, {"neighborhood": "Golf Course Villa", "price": 600000, "bedrooms": 3, "bathrooms": 2, "house_size": 2100, "description": "Luxurious villa overlooking the golf course. Spacious living area with vaulted ceilings. Gourmet kitchen with island and pantry. Master suite with walk-in closet and spa-like bathroom. Outdoor patio for al fresco dining.", "neighborhood_description": "Golf course living with access to the course and clubhouse."}, {"neighborhood": "Beachfront Condo", "price": 800000, "bedrooms": 2, "bathrooms": 2, "house_size": 1700, "description": "Modern beachfront condo with panoramic ocean views. Open concept living area with floor-to-ceiling windows. Sleek kitchen with quartz countertops. Master suite with walk-in closet and private balcony.", "neighborhood_description": "Desirable beachfront location with resort-style amenities."}, {"neighborhood": "Ski Lodge", "price": 900000, "bedrooms": 4, "bathrooms": 3, "house_size": 2800, "description": "Ski lodge with mountain views and ski-in/ski-out access. Rustic yet elegant interior with stone fireplace. Gourmet kitchen with breakfast bar. Master suite with private balcony and hot tub.", "neighborhood_description": "Ideal retreat for winter sports enthusiasts with access to ski slopes and apres-ski activities."}, {"neighborhood": "Rural Farmhouse", "price": 350000, "bedrooms": 2, "bathrooms": 1, "house_size": 1500, "description": "Quaint farmhouse on acres of farmland. Wrap-around porch with views of the countryside. Cozy living room with wood-burning stove. Master bedroom with walk-in closet. Perfect for those seeking a peaceful retreat.", "neighborhood_description": "Tranquil setting with open fields and fresh air."}, {"neighborhood": "City Penthouse", "price": 1200000, "bedrooms": 3, "bathrooms": 3, "house_size": 2200, "description": "Luxurious penthouse in the heart of the city. Floor-to-ceiling windows with city views. Chef's kitchen with top-of-the-line appliances. Master suite with walk-in closet and spa-like bathroom. Rooftop terrace with panoramic city skyline.", "neighborhood_description": "Exclusive urban living with upscale dining and entertainment options."}, {"neighborhood": "Historic Mansion", "price": 1500000, "bedrooms": 6, "bathrooms": 5, "house_size": 4000, "description": "Grand historic mansion with period details and modern updates. Formal living and dining rooms. Gourmet kitchen with marble countertops. Luxurious master suite with sitting area and fireplace. Landscaped gardens and outdoor entertaining spaces.", "neighborhood_description": "Prestigious neighborhood with historic homes and cultural attractions."}]}